# StructuralSectionGeneralC Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionGeneralC Class
Members See Also
---
Defines parameters for Channel Cold Formed shape.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public class StructuralSectionGeneralC : StructuralSectionColdFormed
```

Visual Basic
---
```text
Public Class StructuralSectionGeneralC _
	Inherits StructuralSectionColdFormed
```

Visual C++
---
```text
public ref class StructuralSectionGeneralC : public StructuralSectionColdFormed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionColdFormed Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralC Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionCProfile Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionCProfileWithLips
# See Also
StructuralSectionGeneralC Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace